-- 최종 C11 ~ D5 
---------------------------------------------------C-11 교육생 팀편성-------------------------------------------------------
set serveroutput on;
-- 1. 검색
begin
--                               ID        PW
    proTTeamFormationSearch('tpdls1990',1234927);
end;
--2 수정
begin
--                               ID        PW    팀 학생번호 순차적으로
    proTTeamFormationChange('tpdls1990',1234927, 5 ,1,2,3,4,5,6);
end;
--3 삭제
begin
--                               ID        PW   학생번호 순차적으로
    proTTeamFormationremove('tpdls1990',1234927,1,2,3,4,5,6);
end;
--4 추가 
begin
--                               ID    PW     팀 학생번호 순차적으로
    proTTeamFormationAdd('tpdls1990',1234927,10  ,1,2,3,4,5,6);
end;
---------------------------------------------------C-11 교육생 팀편성-------------------------------------------------------
rollback;
commit;
--------------------------------------------------C-12 상담 신청자 조회--------------------------------------------------------
--1 . 조회
begin
--                      ID          PW
    ProTCounselSearch('tpdls1990',1234927);
end;
--------------------------------------------------C-12 상담 신청자 조회--------------------------------------------------------
rollback;
commit;
-------------------------------------------------------D-01 계정-------------------------------------------------------------
--1. 기본 정보 조회
begin
--                          ID        PW
    ProSAccountBasicSearch('qrs102','2325740');
end;
--2. 현재 수강중인 과정 및 과정명 ,담당 교사 ,기간 등 확인.
begin
--                          ID        PW
    ProSAccountSugangSearch('qrs102','2325740');
end;
-------------------------------------------------------D-01 계정-------------------------------------------------------------
rollback;
commit;
-----------------------------------------------------D-02 성적 조회-----------------------------------------------------------
-- 1.현재 수강중인 과정명과 과목명 , 과목별 기간을 출력
begin
--                              ID        PW
    ProSGradeCheckclassSearch('qrs102','2325740');
end;
-- 2.전체 or 과목 선택 후 시험 정보 조회
begin
--                                ID        PW     과목명 / 빈칸 입력시 전체 조회
    ProSGradeCheckclassSelSearch('qrs102','2325740','');
end;
-----------------------------------------------------D-02 성적 조회-----------------------------------------------------------
rollback;
commit;
-------------------------------------------------------D-03 출결-------------------------------------------------------------
-- 1. 본인 출결 전체 및 날짜별 조회
begin
--                       ID       PW
    ProSAttendSelSearch('qrs102','2325740','');
end;
-- 2. 출결 입력
-------2-1. 출근
begin
--               ID         PW
    ProSGoTowork('qrs102','2325740');
end;
-------2-2. 퇴근
begin
--               ID         PW
    ProSOffWork('qrs102','2325740');
end;
-------------------------------------------------------D-03 출결-------------------------------------------------------------
rollback;
commit;
---------------------------------------------------D-04 Q&A 작성------------------------------------------------------
-- 1. 작성
begin
--                   ID       PW             질문 내용 작성  
    ProSQuesrionadd('qrs102','2325740','프로시저 질문 가능한지 테스트');
end;
-- 2. 조회
begin
--                      ID        PW
    ProSQuestionSearch('qrs102','2325740');
end;
---------------------------------------------------D-04 Q&A 작성------------------------------------------------------
rollback;
commit;
---------------------------------------------------D-05 상담 신청-------------------------------------------------------
-- 1. 선생님 or 관리자 상담신청
begin
--                   ID      PW  상담대상(선생님/관리자)   상담내용
    ProSCounselAdd('qrs102','2325740','선생님','프로시저 테스트 중 입니다.');
end;
-- 확인용
select * from tblCounsel where sugang_seq =6 and teacher_seq =11 and target = '선생님';
select * from tblCounsel where sugang_seq =6 and manager_seq =1 and target = '관리자';
--------------------------------------------------D-05 상담 신청-------------------------------------------------------
rollback;
commit;

select * from tblassessment where assessment_seq = 9;

